// Задача 28: Напишите программу, которая принимает на вход число N и выдаёт произведение чисел от 1 до N.
// 4 -> 24 
// 5 -> 120

int multiply (int munUs){
 int temp=0;
    for(int i=1; i<numUs; i++){
        temp=temp*i;
    }
    return temp;
}
int result =
System.Console.WriteLine();
